** Accessing objects properties
There are two ways to directly retrieve a value from objects:
1. Using the familiar dot notation: =obj.name=
2. Using brackets when the property name is inside a variable:
   =obj[name]=

Accessing unknown properties will return =undefined=.

Here is an example contrasting both notations:

#+BEGIN_SRC js
  var fruta = {
    name: "frambuesa",
    howMany: 2,
  };

  fruta.name; // "frambuesa"
  fruta.howMany; // 2

  fruta["name"]; // "frambuesa"
  fruta["howMany"]; // 2

  var property = "name";
  fruta[property]; // "frambuesa"

  fruta.property; // undefined
#+END_SRC

Note that if we pass an object to the brackets instead of a string,
the object =toString= function is called in order to produce a
property name.  If the object does not have a =toString= function (and
does not inherit one from Object.prototype), you will get a
“TypeError: Cannot convert object to primitive value”.

#+BEGIN_SRC js
  var fruta = {
    name: "frambuesa",
    howMany: 2,
  };

  var lookup = {
    toString: function() {
      return "name";
    },
  };

  fruta[lookup]; // "frambuesa"
#+END_SRC

#+RESULTS:
: 42
: undefined

Here the object =lookup= contains only one property, the function
=toString=.  Trying to access the property =lookup= on =fruta= calls
this =toString= function, and the return value as the name of the
property to retrieve from =fruta=.

** Iterating over object properties
Sometimes we need to enumerate all properties of a given object.  This
can be done in a few different ways.

First, using a =for in= loop.  Here we convert an object into a list
of name-value couples.

#+BEGIN_SRC js
  var o = {a: 1, b: 'b', c: {}};
  var items = [];
  for (var prop in o)
    items.push([prop, o[prop]]);
  console.log(items);
#+END_SRC
#+RESULTS:
| a | 1  |
| b | b  |
| c | {} |

Note that this is an example of [[Accessing%20objects%20properties][bracketed access]]’s usefulness.

Be aware that inherited enumerable properties will also show up in
=for in=.  See [[Iteration and inherited properties]] for a solution.

*** Enumerable and non-enumerable properties
For the second way, we need to distinguish between enumerable and
non-enumerable properties.

All properties of an object have an internal “enumerable” flag which
indicates whether the property is enumerable or not.  An enumerable
property will show up in =for in= loops.  But be aware that the
properties that show up in =for in= loops for an object are not just
its enumerable properties (see [[Iteration and inherited properties]]).
We can tell if a property is enumerable using the method
=propertyIsEnumerable=.

For these examples we will use arrays (which are also objects), as
the =length= property is non-enumerable.

#+BEGIN_SRC js
  var o = [1,2,3];
  o.propertyIsEnumerable('0'); // true
  o.propertyIsEnumerable('length') // false
#+END_SRC

Alternatively, we can list all enumerable properties of an object
using =Object.keys=.  This gives a second way to iterate over the
properties of an object.

#+BEGIN_SRC js
  var o = [1,2,3]
  var keys = Object.keys(o);
  var items = [];
  for (var i=0; i < keys.length; ++i)
    items.push([keys[i], o[keys[i]]]);
  console.log(items);
#+END_SRC

#+RESULTS:
| 0 | 1 |
| 1 | 2 |
| 2 | 3 |

If, on the other hand, we also want to get the non-enumerable
properties, we can use =Object.getOwnPropertyNames=.

#+BEGIN_SRC js
  var o = [1,2,3];
  var names = Object.getOwnPropertyNames(o);
  var items = [];
  for (var i=0; i < names.length; ++i)
    items.push([names[i], o[names[i]]]);
  console.log(items);
#+END_SRC

#+RESULTS:
|      0 | 1 |
|      1 | 2 |
|      2 | 3 |
| length | 3 |

*** Iteration and inherited properties
Using =for in= to iterate over the enumerable properties of an object
will also include the enumerable properties of this object’s
prototype.

#+BEGIN_SRC js
  var o = Object.create({a: 1});
  o.b = 2;
  var items = [];
  for (var prop in o)
    items.push([prop, o[prop]]);
  console.log(items);
#+END_SRC
#+RESULTS:
| b | 2 |
| a | 1 |

Compare this to using =Object.keys()= or =Object.getOwnPropertyNames=,
which both include only an object’s /own/ properties.

#+BEGIN_SRC js
  var o = Object.create({a: 1});
  o.b = 2;
  Object.keys(o); // [ 'b' ]
  Object.getOwnPropertyNames(o);  // [ 'b' ]
#+END_SRC

Be aware that =propertyIsEnumerable= is defined only for an object’s
own properties.  It will return false for inherited enumerable
properties.

Lastly, you can check if a property is inherited or not using
=hasOwnProperty=.

#+BEGIN_SRC js
  var o = Object.create({a: 1});
  o.b = 2;
  o.hasOwnProperty('a'); // false
  o.hasOwnProperty('b'); // true
#+END_SRC

If for some reason you need to iterate on an object’s own enumerable
properties with =for in= (if you do not have access to =Object.keys=),
then the common idiom is:

#+BEGIN_SRC js
  var o = Object.create({a: 1});
  o.b = 2;
  var items = [];
  for (var prop in o)
    if (o.hasOwnProperty(prop))
      items.push([prop, o[prop]]);
  console.log(items);
#+END_SRC
#+RESULTS:
| b | 2 |

** Serializing objects
Serializing objects in JavaScript is easily done by calling
=JSON.stringify=, which takes an object and returns a JSON string.

#+BEGIN_SRC js :results output
  var books = {
    '1-4493-6072-6': {
      title: 'Functional JavaScript',
      author: 'Michael Fogus',
      publisher: 'O’Reilly Media',
      price: 32.99,
    },
    '0-321-81218-2': {
      title: 'Effective JavaScript',
      author: 'David Herman',
      publisher: 'Addision-Wesley Professional',
      price: 31.99,
    },
  };

  console.log(JSON.stringify(books));
#+END_SRC

#+RESULTS:
: {"1-4493-6072-6":{"title":"Functional JavaScript","author":"Michael Fogus","publisher":"O’Reilly Media","price":32.99},"0-321-81218-2":{"title":"Effective JavaScript","author":"David Herman","publisher":"Addision-Wesley Professional","price":31.99}}

To reconstruct a JavaScript object from a JSON string, use
=JSON.parse=.

#+BEGIN_SRC js :results output
  var books = JSON.parse('{"1-4493-6072-6":{"title":"Functional JavaScript","author":"Michael Fogus","publisher":"O’Reilly Media","price":32.99},"0-321-81218-2":{"title":"Effective JavaScript","author":"David Herman","publisher":"Addision-Wesley Professional","price":31.99}}');

  console.log(books["0-321-81218-2"].title);
#+END_SRC

#+RESULTS:
: Effective JavaScript

Serialization using the JSON format is very convenient when
exchanging information between two endpoints.  You can even save
JavaScript data as JSON in database, and recreate the objects at a
later point.

*** Serialization of cyclic structures and functions
There are two things to keep in mind when serializing with JSON:
1. =JSON.stringify= will not work on cyclic objects (the JSON
   representation would be infinite).

   #+BEGIN_SRC js
     var o = {};
     o.o = o;
     JSON.stringify(o);
   #+END_SRC

   This raises a “TypeError: Converting circular structure to JSON”.
2. Serialization ignores functions.

   #+BEGIN_SRC js :results output
     var o = {f: function() { return 42; }};
     console.log(JSON.stringify(o));
   #+END_SRC

   #+RESULTS:
   : {}

** Objects for namespacing
In [[Objects for grouping properties]], we see that objects can serve as a
convenient container of related values.  Sometimes, we want to group
related functions together also.  A simple object suffices.  Here for
instance, an =utils= object groups commonly-used vector functions.

#+BEGIN_SRC js :results output
  var utils = {
    distanceBetween: function(p1, p2) {
      return Math.sqrt((p1.x - p2.x) * (p1.x - p2.x)
                       + (p1.y - p2.y) * (p1.y - p2.y));
    },

    angleBetween: function(p1, p2) {
      return Math.atan2(p2.y - p1.y, p2.x - p1.x);
    },
  };

  console.log(utils.distanceBetween({x:12, y:1}, {x:0, y:0}));
#+END_SRC

#+RESULTS:
: 12.041594578792296

